In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

In [5]:
df = sns.load_dataset("iris")
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [7]:
#finding sepal_lentgh value greater than 7.5
df.loc[df["sepal_length"]>7.5,:]

     sepal_length  sepal_width  petal_length  petal_width    species
105           7.6          3.0           6.6          2.1  virginica
117           7.7          3.8           6.7          2.2  virginica
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
131           7.9          3.8           6.4          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica

In [9]:
df.loc[(df["sepal_length"]>7.5) & (df["petal_length"]>6.5) , :]

     sepal_length  sepal_width  petal_length  petal_width    species
105           7.6          3.0           6.6          2.1  virginica
117           7.7          3.8           6.7          2.2  virginica
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica

In [13]:
df.loc[(df["sepal_length"]>7.5) & (df["petal_length"]>6.5) , ["species"]]

       species
105  virginica
117  virginica
118  virginica
122  virginica

In [16]:
df.loc[df["sepal_length"] == 7.7,:]

     sepal_length  sepal_width  petal_length  petal_width    species
117           7.7          3.8           6.7          2.2  virginica
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica

#Merging And Group by

In [33]:
#creating a customer dataframe
cust_data = {"cust_name": ["srinu","vasu","charan","bharath","ajay","sri ram","chandhu","karthik","ganesh","saran"],
             "cust_id": [1,2,3,4,5,6,7,8,9,10]}
cust_df = pd.DataFrame(cust_data)
cust_df

  cust_name  cust_id
0     srinu        1
1      vasu        2
2    charan        3
3   bharath        4
4      ajay        5
5   sri ram        6
6   chandhu        7
7   karthik        8
8    ganesh        9
9     saran       10

In [31]:
#creating product dataframe
product_data = {"product_id" : ["p-1","p-2","p-3","p-4","p-5","p-6","p-7","p-8","p-9","p-10"],
                "product_name" : ["laptop","mouse","keyboard","earphone","charger","mobile","laptop","laptop","earphone","mouse"]}
prod_df = pd.DataFrame(product_data)
prod_df

  product_id product_name
0        p-1       laptop
1        p-2        mouse
2        p-3     keyboard
3        p-4     earphone
4        p-5      charger
5        p-6       mobile
6        p-7       laptop
7        p-8       laptop
8        p-9     earphone
9       p-10        mouse

In [34]:
#creating purchase dataframe 
purchace_data = {"cust_id": [1,2,3,4,5,6,7,8,9,10],
                 "product_id" : ["p-1","p-2","p-3","p-4","p-5","p-6","p-7","p-8","p-9","p-10"]}
purchase_df = pd.DataFrame(purchace_data)
purchase_df

   cust_id product_id
0        1        p-1
1        2        p-2
2        3        p-3
3        4        p-4
4        5        p-5
5        6        p-6
6        7        p-7
7        8        p-8
8        9        p-9
9       10       p-10

In [35]:
#merging cust_data and purchase data
df = pd.merge(cust_df,purchase_df,how = "inner",on = "cust_id")
df

  cust_name  cust_id product_id
0     srinu        1        p-1
1      vasu        2        p-2
2    charan        3        p-3
3   bharath        4        p-4
4      ajay        5        p-5
5   sri ram        6        p-6
6   chandhu        7        p-7
7   karthik        8        p-8
8    ganesh        9        p-9
9     saran       10       p-10

In [ ]:
#merging updated df and product data
data = pd.merge(df,prod_df,how="inner",on = "product_id")
data

  cust_name  cust_id product_id product_name
0     srinu        1        p-1       laptop
1      vasu        2        p-2        mouse
2    charan        3        p-3     keyboard
3   bharath        4        p-4     earphone
4      ajay        5        p-5      charger
5   sri ram        6        p-6       mobile
6   chandhu        7        p-7       laptop
7   karthik        8        p-8       laptop
8    ganesh        9        p-9     earphone
9     saran       10       p-10        mouse

In [37]:
data["product_name"].value_counts()

product_name
laptop      3
mouse       2
earphone    2
keyboard    1
charger     1
mobile      1
Name: count, dtype: int64

In [38]:
data.sort_values(by="cust_id",ascending=False)

  cust_name  cust_id product_id product_name
9     saran       10       p-10        mouse
8    ganesh        9        p-9     earphone
7   karthik        8        p-8       laptop
6   chandhu        7        p-7       laptop
5   sri ram        6        p-6       mobile
4      ajay        5        p-5      charger
3   bharath        4        p-4     earphone
2    charan        3        p-3     keyboard
1      vasu        2        p-2        mouse
0     srinu        1        p-1       laptop

In [40]:
#ine of the customer will pick from the each product name
new_df = data.groupby("product_name")
new_df.first()

             cust_name  cust_id product_id
product_name
charger           ajay        5        p-5
earphone       bharath        4        p-4
keyboard        charan        3        p-3
laptop           srinu        1        p-1
mobile         sri ram        6        p-6
mouse             vasu        2        p-2

In [ ]:
#printing the groupby column keys
new_df.groups.keys()

dict_keys(['charger', 'earphone', 'keyboard', 'laptop', 'mobile', 'mouse'])

In [45]:
#priting all the customers who buyed laptop
df1 =new_df.get_group("laptop")
df1

  cust_name  cust_id product_id product_name
0     srinu        1        p-1       laptop
6   chandhu        7        p-7       laptop
7   karthik        8        p-8       laptop

In [47]:
df2 = new_df.get_group("mouse")
df2

  cust_name  cust_id product_id product_name
1      vasu        2        p-2        mouse
9     saran       10       p-10        mouse

In [55]:
pd.concat([df1,df2],axis=0,ignore_index=True)

  cust_name  cust_id product_id product_name
0     srinu        1        p-1       laptop
1   chandhu        7        p-7       laptop
2   karthik        8        p-8       laptop
3      vasu        2        p-2        mouse
4     saran       10       p-10        mouse

In [ ]:
new_df.describe()

             cust_id
               count      mean       std  min   25%  50%   75%   max
product_name
charger          1.0  5.000000       NaN  5.0  5.00  5.0  5.00   5.0
earphone         2.0  6.500000  3.535534  4.0  5.25  6.5  7.75   9.0
keyboard         1.0  3.000000       NaN  3.0  3.00  3.0  3.00   3.0
laptop           3.0  5.333333  3.785939  1.0  4.00  7.0  7.50   8.0
mobile           1.0  6.000000       NaN  6.0  6.00  6.0  6.00   6.0
mouse            2.0  6.000000  5.656854  2.0  4.00  6.0  8.00  10.0

In [58]:
iris_data = sns.load_dataset("iris")
iris_data.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [62]:
df = iris_data.groupby("species")
df["sepal_length"].mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

In [63]:
df["sepal_length"].describe()

            count   mean       std  min    25%  50%  75%  max
species
setosa       50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor   50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica    50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9